examples/xml/DODA_BZ701093.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mat="http://impl.service.qrws.ce.siat.sat.gob.mx/siatbus/matce" xmlns:xd="http://www.w3.org/2000/09/xmldsig#"><soapenv:Header/><soapenv:Body><mat:altaDoda><dodas><credenciales><ciec><Usuario>BAAR511228H74</Usuario><Contrasena></Contrasena></ciec><sellado><cadenaOriginalAA>||160|3171|1|7001093|2017-04-12 04:52:45||</cadenaOriginalAA><certificado64>Sf4oeBb6JGHrigwC0hOF2DvxWkYAgRJ+mfa0vTHODWDvcmvVk+S1Oj9o/xKR9FUuwTEMC5kmJj+ySzEdMChf3xjJZJbVUCnl1OHQPVo5OlBmziYuYyT5aXJoLvyl31bvAXCMzmM7Eydm1Gv0E3X6PD+kQrQB2wO1NWIfzI4t+5s=</certificado64><firmado>YEbf+EUtT0tHj3ex9bPbi/2mTyvds5xsjov3n6G8o1EXIPE1NNtGuBeKAzZKeCxp3zBiEA2bB0P033Y9rMdDMAxAmBnAFZcoDBBnEtiltikfj5NBTqjMrW2KbUjTK9yv+VMRvWY6gT0LKCjpJD8aTp9l9yhGolNgl33UUF9fU8M=</firmado><serie>00001000000305069232</serie></sellado></credenciales><doda><datosGenerales><aduana>16</aduana><seccion>0</seccion><caat>MOLPARADISE</caat><contenedores><contenedor><candados><valorCandado></valorCandado></candados><valorContenedor></valorContenedor></contenedor></contenedores><idTransporte></idTransporte><fastId></fastId><pedimentoAmericano><valorPedimentoAmericano></valorPedimentoAmericano><tipoPedimentoAmericano></tipoPedimentoAmericano></pedimentoAmericano><tipoOperacion>1</tipoOperacion></datosGenerales><pedimentos><pedimento><patenteAutorizacion>3171</patenteAutorizacion><documento>7001093</documento><numeroRemesa></numeroRemesa><dtaNiu></dtaNiu><importeDifDolares></importeDifDolares><importeEfectivoDolares>564</importeEfectivoDolares><umc></umc><articulo7>0</articulo7><cove></cove></pedimento></pedimentos></doda><xd:Signature><xd:SignedInfo><xd:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/><xd:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><xd:Reference URI="?"><xd:Transforms><xd:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/></xd:Transforms><xd:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><xd:DigestValue></xd:DigestValue></xd:Reference></xd:SignedInfo><xd:SignatureValue></xd:SignatureValue><xd:KeyInfo><xd:KeyValue><xd:RSAKeyValue><xd:Modulus></xd:Modulus><xd:Exponent></xd:Exponent></xd:RSAKeyValue></xd:KeyValue></xd:KeyInfo></xd:Signature></dodas></mat:altaDoda></soapenv:Body></soapenv:Envelope>